snlkuharlocal/src/DataProcessors/ВыгрузкаДанныхCommerceML/ВыгрузкаДанныхCommerceML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаДанныхCommerceML</name>
  <attributes>
    <name>ИмяФайлаВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостроительОтчетаКаталог</name>
    <type>
      <types>ReportBuilder</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостроительОтчетаПрайс</name>
    <type>
      <types>ReportBuilder</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКаталога</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПрайса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВыгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПостроительОтчетаДокументы</name>
    <type>
      <types>ReportBuilder</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеревоДокументов</name>
    <type>
      <types>ValueTree</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПоЭлПочте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПостроительОтчетаПрайсCML_1</name>
    <type>
      <types>ReportBuilder</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненныеНастройкиПостроителяКаталог</name>
  </attributes>
  <attributes>
    <name>СохраненныеНастройкиПостроителяПрайс</name>
  </attributes>
  <attributes>
    <name>СохраненныеНастройкиПостроителяДокументы</name>
  </attributes>
  <attributes>
    <name>СохраненныеНастройкиПостроителяПрайсCML_1</name>
  </attributes>
  <attributes>
    <name>ИмяПрайсаCML_1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьКаталог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьСведенияОбОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействительноС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДействительноПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Классификатор</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствиеКонтрагентовИФайлов</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатВыгрузки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДокументов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/ТипыШтрихКодов/ТипыШтрихКодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШтрихКодов</name>
  <enumValues>
    <name>Штука</name>
    <comment>Штрих код штуки</comment>
  </enumValues>
  <enumValues>
    <name>Блочок</name>
    <comment>Штрих код блочка</comment>
  </enumValues>
  <enumValues>
    <name>Коробка</name>
    <comment>Штрих код коробки</comment>
  </enumValues>
  <enumValues>
    <name>Палета</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/DataProcessors/ВыгрузкаДанныхCommerceML/ObjectModule.bsl
Перем мФормаХодаВыполненияОбмена Экспорт; 
Перем мТаблицаВсехСвойствТоваров Экспорт;
Перем ВыводитьИнформационныесообщения;

#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ДЛЯ НАСТРОЙКИ ПОСТРОИТЕЛЕЙ ОТЧЕТОВ

Функция ПолучитьМассивДопустимыхТиповНоменклатурыДляВыгрузки()
	
	МассивТипов = Новый Массив();
	
	МассивТипов.Добавить(Перечисления.ТипыНоменклатуры.Товар);
	//МассивТипов.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
	
	Возврат МассивТипов;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ ДЛЯ АЛГОРИТМОВ ВЫГРУЗКИ ДАННЫХ

//// Процедура вызывает диалог выбора файла, если выбирается каталог,
//// то генерирует имя файла, используя текущую дату и время
////
//// Параметры:
////  РежимДиалога - режим вызова диалога выбора файла
////
Функция ВыборФайла2(РежимДиалога, ИмяФайлаПоУмолчанию = "") Экспорт

	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалога);

	ДиалогВыбора.Фильтр     = "Файл данных (*.xml)|*.xml";
	ДиалогВыбора.Расширение = "xml";
	
	Если РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога Тогда
		ДиалогВыбора.Заголовок ="Выберите каталог для выгрузки документов";
	Иначе
		ДиалогВыбора.Заголовок ="Выберите файл для выгрузки данных";
	КонецЕсли;

	ДиалогВыбора.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбора.ИндексФильтра               = 0;
	ДиалогВыбора.ПроверятьСуществованиеФайла = Ложь;
	
	Если Не ПустаяСтрока(ИмяФайлаПоУмолчанию) Тогда
		
		ДиалогВыбора.ПолноеИмяФайла = ИмяФайлаПоУмолчанию;	
		
	КонецЕсли;

	Если НЕ ДиалогВыбора.Выбрать() Тогда
		Возврат Неопределено;
	ИначеЕсли РежимДиалога = РежимДиалогаВыбораФайла.ВыборКаталога Тогда
		
		Возврат ДиалогВыбора.Каталог;
		
	Иначе
		
		Возврат ДиалогВыбора.ПолноеИмяФайла;
		
	КонецЕсли;			
	
КонецФункции

// Процедура проводит проверку значнеие и пишет текстовой узел в файл XML
//
// Параметры:
//  ОбъектXML - объект ЗаписьXML
//  Имя       - наименования узла
//  Значение  - текстовое значение для записи в файл
//
Процедура ЗаписатьТекстовойУзел(ОбъектXML, Имя, Значение, ОбязательнаяПроверкаНаПустуюСтроку = Истина)

	СтрокаЗаписи = Строка(Значение);
	Если ОбязательнаяПроверкаНаПустуюСтроку
		И НЕ ЗначениеЗаполнено(СтрокаЗаписи) Тогда
		
		Возврат;		
		
	КонецЕсли;
	
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		
		СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, Символы.НПП, "");
		СтрокаЗаписи = СтрЗаменить(СтрокаЗаписи, ",", ".");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
		
		Если Значение Тогда
			СтрокаЗаписи = "true";
		Иначе
			СтрокаЗаписи = "false";
		КонецЕсли;
		
	КонецЕсли;
	
	ОбъектXML.ЗаписатьНачалоЭлемента(Имя);
	ОбъектXML.ЗаписатьТекст(СтрокаЗаписи);
	ОбъектXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

// Процедура проводит проверку значнеие и пишет текстовой узел в файл XML
//
// Параметры:
//  ОбъектXML - объект ЗаписьXML
//  Имя       - наименования узла
//  Значение  - текстовое значение для записи в файл
//
Процедура ЗаписатьАтрибут(ОбъектXML, Имя, Значение)

	СтрокаЗаписи = Строка(Значение);
	Если ЗначениеЗаполнено(СтрокаЗаписи) Тогда
		ОбъектXML.ЗаписатьАтрибут(Имя, СтрокаЗаписи)
	КонецЕсли;

КонецПроцедуры

// Функция формирует идентификатор для товара, по элементу номенклатуры и характеристика
//
// Параматры:
//  Номенклатура   - справочник-ссылка Номенклатура
//  Характеристика - справочник-ссылка ХарактеристикиНоменклатуры
//
// Возвращаемое значение:
//  строка - идентификатор товара для каталога
//
Функция СформироватьИдентификатовТовара(Номенклатура, Характеристика)

	Если НЕ ЗначениеЗаполнено(Характеристика) Тогда
		
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			Возврат "";
		Иначе		
			Возврат Строка(Номенклатура.УникальныйИдентификатор());
		КонецЕсли;
		
	Иначе
		
		Возврат Строка(Номенклатура.УникальныйИдентификатор()) + "#" + Строка(Характеристика.УникальныйИдентификатор());
		
	КонецЕсли;

КонецФункции

// Функция формирует идентификатор для товара, по элементу номенклатуры и характеристика
//
// Параматры:
//  Номенклатура   - справочник-ссылка Номенклатура
//  Характеристика - справочник-ссылка ХарактеристикиНоменклатуры
//
// Возвращаемое значение:
//  строка - идентификатор товара для каталога
//
Функция СформироватьИдентификатовТовараПоКодам(Номенклатура, Характеристика)

	Если НЕ ЗначениеЗаполнено(Характеристика) Тогда
		Возврат Строка(Номенклатура.Код);
	Иначе
		Возврат Строка(Номенклатура.Код) + СтрЗаменить(Строка(Характеристика.УникальныйИдентификатор()), "-", "");
	КонецЕсли;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАПИСИ В ФАЙЛ ЭЛЕМЕНТОВ ДАННЫХ

// Процедура показывает новое сообщение в форме хода обработки данных
Процедура ОтобразитьНовоеСообщениеВФормеХодаОбработки(Знач ТекстСообщения, Знач ПроцентПрибавления = 0)
	
	мФормаХодаВыполненияОбмена.КомментарийОбработкиДанных = ТекстСообщения;	
	мФормаХодаВыполненияОбмена.Значение = мФормаХодаВыполненияОбмена.Значение + ПроцентПрибавления;		
		
КонецПроцедуры

// Процедура показывает новое сообщение в форме хода обработки данных
Процедура ИнициализироватьФормуХодаОбработки(Знач ТекстСообщения = "", Знач ПроцентПрибавления = 0, МаксимальноеЗначение = 100)
	
	Если мФормаХодаВыполненияОбмена = Неопределено Тогда
		
		мФормаХодаВыполненияОбмена = ПолучитьОбщуюФорму("ХодВыполненияОбработкиДанных");
					
	КонецЕсли;
	
	мФормаХодаВыполненияОбмена.НаименованиеОбработкиДанных = "Выгрузка данных CommerceML";
	мФормаХодаВыполненияОбмена.КомментарийОбработкиДанных = ТекстСообщения;	
	мФормаХодаВыполненияОбмена.Значение = ПроцентПрибавления;
	мФормаХодаВыполненияОбмена.МаксимальноеЗначение = МаксимальноеЗначение;
	
	Если Не мФормаХодаВыполненияОбмена.Открыта() Тогда
		мФормаХодаВыполненияОбмена.Открыть();
	КонецЕсли;		
		
КонецПроцедуры

//Процедура закрывает форму хода обработки данных
Процедура ЗакрытьФормуОбработкиДанных()
	
	Если мФормаХодаВыполненияОбмена <> Неопределено Тогда
		
		Если мФормаХодаВыполненияОбмена.Открыта() Тогда
			мФормаХодаВыполненияОбмена.Закрыть();
		КонецЕсли;			
		
	КонецЕсли;	
		
КонецПроцедуры



// Процедура присваивает текст запроса для построителя документов.
//
// Параметры:
// Построитель - построитель отчета для которого устанавливается настройка
//
Процедура НастроитьПостроительДляДокументов(Построитель, ИмяДокумента) Экспорт

	Построитель.Текст = "ВЫБРАТЬ
	                    |	ДокументОбъект.Контрагент КАК Контрагент,
	                    |	ДокументОбъект.Ссылка КАК ДокументыСсылка,
	                    |	ДокументОбъект.СостояниеНакладной
	                    |ИЗ
	                    |	Документ.РасходнаяНакладная КАК ДокументОбъект
	                    |ГДЕ
	                    |	ДокументОбъект.ПометкаУдаления = ЛОЖЬ
	                    |{ГДЕ
	                    |	ДокументОбъект.Контрагент.Ссылка.* КАК Контрагент,
	                    |	ДокументОбъект.Ссылка.* КАК Документ}
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	Контрагент,
	                    |	ДокументОбъект.Дата";

КонецПроцедуры



Функция ОпределитьВыгружаютсяДокументы(ТипОбработки) Экспорт
	
	Возврат ТипОбработки = "ЗаказПоставщику"
		ИЛИ ТипОбработки = "СчетНаОплатуПокупателю"
		ИЛИ ТипОбработки = "РеализацияТоваровУслуг"
		ИЛИ ТипОбработки = "СчетФактураВыданный"
		ИЛИ ТипОбработки = "ПереоценкаТоваровОтданныхНаКомиссию"
		ИЛИ ТипОбработки = "ВозвратТоваровПоставщику"
		ИЛИ ТипОбработки = "ОтчетКомитентуОПродажах";	
	
КонецФункции

Функция ОпределитьКоличествоДокументовПодлежащихВыгрузке() Экспорт
	
	КоличествоДляВыгрузки = 0;
	
	Для Каждого СтрокаКонтрагент Из ДеревоДокументов.Строки Цикл

		Если НЕ СтрокаКонтрагент.Обрабатывать Тогда
			Продолжить;
		КонецЕсли;

		Для Каждого СтрокаДокумент Из СтрокаКонтрагент.Строки Цикл
			
			Если СтрокаДокумент.Обрабатывать = 1 Тогда
				КоличествоДляВыгрузки = КоличествоДляВыгрузки + 1;
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЦикла;
	
	Возврат КоличествоДляВыгрузки;	
	
КонецФункции

Функция ОпределитьИмяФайлаДляСохраненияПоУмолчанию(ИмяКонтрагента, ТипОбработки)
	
	// имя файла - имя контрагента +_ имя документа + дата
	Возврат  РаботаСФайлами.УдалитьЗапрещенныеСимволыИмени(ИмяКонтрагента + "_" + ТипОбработки + "_" + Формат(РабочаяДата, "ДФ=yyyy-MM-dd") + ".xml");		
	
КонецФункции

Функция ВыгрузитьНаборДокументовВКаталог(ТипОбработки, ИмяОсновногоКаталога, ОбщееКоличествоДокументовДляВыгрузки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ИмяОсновногоКаталога) Тогда
		Предупреждение("Не указано имя каталога для выгрузки данных! Операция не может быть выполнена!");
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	РаботаСФайлами.ПроверитьСуществованиеКаталога(ИмяОсновногоКаталога);
	
	РезультатВыгрузки = Истина;
	
	ИнициализироватьФормуХодаОбработки("Выгрузка документов", 0, ОбщееКоличествоДокументовДляВыгрузки);
	
	Для Каждого СтрокаКонтрагент Из ДеревоДокументов.Строки Цикл

		Если НЕ СтрокаКонтрагент.Обрабатывать Тогда
			Продолжить;
		КонецЕсли;

		СписокДок = Новый СписокЗначений();
		Для Каждого СтрокаДокумент Из СтрокаКонтрагент.Строки Цикл
			
			Если СтрокаДокумент.Обрабатывать = 1 Тогда
				СписокДок.Добавить(СтрокаДокумент.Строка);
			КонецЕсли;
			
		КонецЦикла;
		
		Если СписокДок.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяКонтрагента = Строка(СтрокаКонтрагент.Строка); 
		
	//	ОтобразитьНовоеСообщениеВФормеХодаОбработки("Документы контрагента: " + ИмяКонтрагента, СписокДок.Количество());
		
		ИмяФайлаДляВыгрузки = ОпределитьИмяФайлаДляСохраненияПоУмолчанию(ИмяКонтрагента, ТипОбработки); 
		
		ИмяВремФайла = ИмяОсновногоКаталога + "\" + ИмяФайлаДляВыгрузки;
		
		СтрокаСоответствияФайлов = СоответствиеКонтрагентовИФайлов.Добавить();
		СтрокаСоответствияФайлов.Контрагент = СтрокаКонтрагент.Строка;
		СтрокаСоответствияФайлов.ИмяФайла = ИмяФайлаДляВыгрузки;
		СтрокаСоответствияФайлов.КоличествоДокументов = СписокДок.Количество();
				
		Попытка
			ТекРезультатВыгрузки = ВыгрузитьВФайл(ТипВыгрузки, ИмяВремФайла, СписокДок, Ложь);
			СтрокаСоответствияФайлов.РезультатВыгрузки = ТекРезультатВыгрузки;			
		Исключение
			СтрокаСоответствияФайлов.РезультатВыгрузки = Ложь;
			СообщитьОбОшибке("Ошибка при сохранении документов контрагента: " + Строка(СтрокаСоответствияФайлов.Контрагент) + Символы.ПС + ОписаниеОшибки()); 
			ТекРезультатВыгрузки = Ложь;
		КонецПопытки;
		
		РезультатВыгрузки = РезультатВыгрузки И ТекРезультатВыгрузки;		

	КонецЦикла;
	
	ЗакрытьФормуОбработкиДанных();
	
	Возврат РезультатВыгрузки;
	
КонецФункции

Процедура ЗаписатьШапкуФайла(ОбъектXML)
	
	ОбъектXML.ЗаписатьАтрибут("ВерсияСхемы", "2.03");
	ОбъектXML.ЗаписатьАтрибут("ДатаФормирования", Формат(РабочаяДата, "ДФ=yyyy-MM-dd'T'ЧЧ:мм:сс"));
	
КонецПроцедуры

// Функция контролирует возможность выгрузки данных и запускает 
// механизмы выгрузки данных в зависимости от передаваемых параметров
//
// Параметры:
//  ТипОбработки - строка, служит для определения типа выгружаемых объектов
//  ИмяФайла     - строка - имя файла, куда осуществляется выгрузка
//  СписокДок    - список-значений - список документов для выгрузки
//
//Возвращаемое значение:
//  булево - истина если выгрузка успешна, иначе ложь
//
Функция ВыгрузитьВФайл(ТипОбработки, ИмяФайла, СписокДокументов = Неопределено, ИнформироватьОПроцессеВыгрузки = Истина) Экспорт
   //3 ступень
	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		Предупреждение("Не указано имя файла выгрузки! Операция не может быть выполнена!");
		Возврат ЛОЖЬ;
	КонецЕсли;

	Если НЕ ОпределитьВыгружаютсяДокументы(ТипОбработки) И НЕ ЗначениеЗаполнено(Организация) Тогда
		Предупреждение("Не указана организация! Операция не может быть выполнена!");
		Возврат ЛОЖЬ;
	КонецЕсли;

	ИдКаталога = Организация.УникальныйИдентификатор();

	ОбъектXML = Новый ЗаписьXML;
	
	ОбъектXML.ОткрытьФайл(ИмяФайла, "UTF-16");
	

	ОбъектXML.ЗаписатьОбъявлениеXML();
	ОбъектXML.ЗаписатьНачалоЭлемента("КоммерческаяИнформация");

		
	ВыгрузитьДокументы(ОбъектXML, СписокДокументов, ТипОбработки, ИнформироватьОПроцессеВыгрузки);
	
	
	
	
	

	ОбъектXML.ЗаписатьКонецЭлемента();
	ОбъектXML.Закрыть();

	Возврат ИСТИНА;

КонецФункции


// Процедура пищет электронные документы "Заказ товара"
//
// Параметры:
//  ОбъектXML        - объект типа ЗаписьXML
//  СписокДок      - список значений, содержит список выгружаемых документов
//
Процедура ВыгрузитьДокументы(ОбъектXML, СписокДок, ТипОбработки, ВыводитьИнформационныесообщения = Истина)
	
	Если ТипОбработки = "РеализацияТоваровУслуг" Тогда
		
		ВыгрузитьРеализациюТоваровУслуг(ОбъектXML, СписокДок, ВыводитьИнформационныесообщения);
	
	
	КонецЕсли;
	
	

КонецПроцедуры

Процедура ВыгрузитьРеализациюТоваровУслуг(ОбъектXML, СписокДок, ВыводитьИнформационныесообщения)
	
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	РеализацияТоваровУслуг.Ссылка КАК ДокСсылка,
	//|	РеализацияТоваровУслуг.Ссылка.Номер КАК Номер,
	//|	РеализацияТоваровУслуг.Ссылка.Дата КАК Дата,
	//|	РеализацияТоваровУслуг.Ссылка.ВалютаДокумента.Наименование КАК Валюта,
	//|	РеализацияТоваровУслуг.Ссылка.Контрагент КАК КонтрагентСсылка,
	//|	РеализацияТоваровУслуг.Ссылка.Организация КАК ОрганизацияСсылка,
	//|	РеализацияТоваровУслуг.Ссылка.СуммаДокумента КАК СуммаДокумента,
	//|	РеализацияТоваровУслуг.Ссылка.КурсВзаиморасчетов КАК КурсВзаиморасчетов,
	//|	РеализацияТоваровУслуг.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	//|	РеализацияТоваровУслуг.Номенклатура.Ссылка КАК НоменклатураСсылка,
	//|	РеализацияТоваровУслуг.Номенклатура.Родитель КАК РодительНоменклатуры,
	//|	РеализацияТоваровУслуг.Номенклатура.Наименование КАК Наименование,
	//|	РеализацияТоваровУслуг.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	//|	РеализацияТоваровУслуг.Номенклатура.Артикул КАК Артикул,
	//|	РеализацияТоваровУслуг.Номенклатура.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения,
	//|	РеализацияТоваровУслуг.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК БазоваяЕдиницаИзмеренияНаименование,
	//|	РеализацияТоваровУслуг.Номенклатура.БазоваяЕдиницаИзмерения.Код КАК БазоваяЕдиницаИзмеренияКод,
	//|	РеализацияТоваровУслуг.Номенклатура.БазоваяЕдиницаИзмерения.НаименованиеПолное КАК БазоваяЕдиницаИзмеренияНаименованиеПолное,
	//|	РеализацияТоваровУслуг.Номенклатура.БазоваяЕдиницаИзмерения.МеждународноеСокращение КАК БазоваяЕдиницаИзмеренияМеждународноеСокращение,
	//|	РеализацияТоваровУслуг.ЕдиницаИзмерения КАК ЕдиницаХраненияОстатков,
	//|	РеализацияТоваровУслуг.ЕдиницаИзмерения.Коэффициент КАК ЕдиницаХраненияОстатковКоэффициент,
	//|	РеализацияТоваровУслуг.ЕдиницаИзмерения.Наименование КАК ЕдиницаХраненияОстатковНаименование,
	//|	РеализацияТоваровУслуг.ЕдиницаИзмерения.Вес КАК ЕдиницаХраненияОстатковВес,
	//|	РеализацияТоваровУслуг.ЕдиницаИзмерения.Объем КАК ЕдиницаХраненияОстатковОбъем,
	//|	РеализацияТоваровУслуг.Номенклатура.ВидНоменклатуры.Наименование КАК ВидНоменклатуры,
	//|	РеализацияТоваровУслуг.Номенклатура.ВидНоменклатуры.ТипНоменклатуры КАК ТипНоменклатуры,
	//|	РеализацияТоваровУслуг.СерияНоменклатуры.Наименование КАК СерияНоменклатурыНаименование,
	//|	РеализацияТоваровУслуг.СерияНоменклатуры.СерийныйНомер КАК СерияНоменклатурыСерийныйНомер,
	//|	РеализацияТоваровУслуг.СерияНоменклатуры.Сертификат КАК СерияНоменклатурыСертификат,
	//|	РеализацияТоваровУслуг.СерияНоменклатуры.СрокГодности КАК СерияНоменклатурыСрокГодности,
	//|	РеализацияТоваровУслуг.СерияНоменклатуры.НомерГТД.Код КАК СерияНоменклатурыНомерГТД,
	//|	РеализацияТоваровУслуг.СерияНоменклатуры.СтранаПроисхождения.Код КАК СерияНоменклатурыСтранаПроисхожденияКОД,
	//|	РеализацияТоваровУслуг.СерияНоменклатуры.СтранаПроисхождения.Наименование КАК СерияНоменклатурыСтранаПроисхожденияНаименование,
	//|	РеализацияТоваровУслуг.СерияНоменклатуры.СтранаПроисхождения.НаименованиеПолное КАК СерияНоменклатурыСтранаПроисхожденияНаименованиеПолное,
	//|	РеализацияТоваровУслуг.СерияНоменклатуры.СтранаПроисхождения.КодАльфа2 КАК СерияНоменклатурыСтранаПроисхожденияКодАльфа2,
	//|	РеализацияТоваровУслуг.СерияНоменклатуры.Комментарий КАК СерияНоменклатурыКомментарий,
	//|	РеализацияТоваровУслуг.Сумма КАК Сумма,
	//|	РеализацияТоваровУслуг.СуммаНДС КАК СуммаНДС,
	//|	РеализацияТоваровУслуг.СтавкаНДС КАК СтавкаНДС,
	//|	РеализацияТоваровУслуг.ХарактеристикаНоменклатуры КАК ХарактеристикаСсылка,
	//|	РеализацияТоваровУслуг.ХарактеристикаНоменклатуры.Наименование КАК НаименованиеХарактеристики,
	//|	РеализацияТоваровУслуг.Количество КАК Количество,
	//|	РеализацияТоваровУслуг.Цена КАК Цена,
	//|	РеализацияТоваровУслуг.Коэффициент КАК Коэффициент,
	//|	РеализацияТоваровУслуг.НомерСтроки КАК НомерСтроки,
	//|	НоменклатураКонтрагентов.КодНоменклатурыКонтрагента КАК Ид,
	//|	РегистрШтрихКоды.Штрихкод КАК ШтрихКод,
	//|	РеализацияТоваровУслуг.Ссылка.Комментарий,
	//|	РеализацияТоваровУслуг.Ссылка.Сделка.НомерВходящегоДокументаЭлектронногоОбмена КАК НомерВходящегоДокументаЭлектронногоОбмена,
	//|	РеализацияТоваровУслуг.Ссылка.Сделка.ДатаВходящегоДокументаЭлектронногоОбмена КАК ДатаВходящегоДокументаЭлектронногоОбмена,
	//|	РеализацияТоваровУслуг.Ссылка.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора
	//|ИЗ
	//|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслуг
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
	//|		ПО РеализацияТоваровУслуг.Ссылка.Контрагент = НоменклатураКонтрагентов.Контрагент
	//|			И РеализацияТоваровУслуг.Номенклатура = НоменклатураКонтрагентов.Номенклатура
	//|			И РеализацияТоваровУслуг.ХарактеристикаНоменклатуры = НоменклатураКонтрагентов.ХарактеристикаНоменклатуры
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК РегистрШтрихКоды
	//|		ПО РеализацияТоваровУслуг.Номенклатура = РегистрШтрихКоды.Владелец
	//|			И РеализацияТоваровУслуг.ХарактеристикаНоменклатуры = РегистрШтрихКоды.ХарактеристикаНоменклатуры
	//|			И РеализацияТоваровУслуг.ЕдиницаИзмерения = РегистрШтрихКоды.ЕдиницаИзмерения
	//|ГДЕ
	//|	РеализацияТоваровУслуг.Ссылка В(&СписокДок)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	ДокСсылка,
	//|	НомерСтроки
	//|ИТОГИ
	//|	СУММА(СуммаНДС),
	//|	МАКСИМУМ(СуммаВключаетНДС),
	//|	МАКСИМУМ(НомерВходящегоДокументаЭлектронногоОбмена),
	//|	МАКСИМУМ(ДатаВходящегоДокументаЭлектронногоОбмена)
	//|ПО
	//|	ДокСсылка");
	//
	
	
	// пишем запрос нужный нам.

	Запрос=Новый запрос;
	
	Запрос.Текст="ВЫБРАТЬ
	             |	РасходнаяНакладная.Номенклатура.Ссылка КАК номенклатураСсылка,
	             |	РасходнаяНакладная.Номенклатура.Родитель КАК Родительноменклатуры,
	             |	РасходнаяНакладная.Количество КАК количество,
	             |	РасходнаяНакладная.Коэффициент КАК коэффициент,
	             |	РасходнаяНакладная.ЦенаБезСкидки,
	             |	РасходнаяНакладная.Цена КАК цена,
	             |	РасходнаяНакладная.Всего КАК сумма,
	             |	РасходнаяНакладная.СтавкаНДС КАК ставкаНДС,
	             |	РасходнаяНакладная.НДС КАК СуммаНДС,
	             |	РасходнаяНакладная.Всего КАК Всего,
	             |	РасходнаяНакладная.Ссылка КАК ДокСсылка,
	             |	РасходнаяНакладная.Ссылка.Номер КАК Номер,
	             |	РасходнаяНакладная.Ссылка.Дата КАК Дата,
	             |	РасходнаяНакладная.Ссылка.Валюта.Наименование КАК Валюта,
	             |	1 КАК КурсВзаиморасчетов,
	             |	РасходнаяНакладная.Ссылка.Организация КАК Организацияссылка,
	             |	РасходнаяНакладная.Ссылка.Контрагент КАК КонтрагентСсылка,
	             |	РасходнаяНакладная.Ссылка.СуммаДокумента КАК СуммаДокумента,
	             |	РасходнаяНакладная.Ссылка.КоличествоДокумента КАК КоличествоДокумента,
	             |	ИСТИНА КАК СуммаВключаетНДС,
	             |	РасходнаяНакладная.Номенклатура.Наименование КАК наименование,
	             |	РасходнаяНакладная.Номенклатура.Наименование КАК наименованиеПолное,
	             |	"""" КАК БазоваяЕдиницаИзмеренияМеждународноеСокращение,
	             |	"""" КАК артикул,
	             |	""товар"" КАК видНоменклатуры,
	             |	""товар"" КАК типНоменклатуры,
	             |	РасходнаяНакладная.Номенклатура.БазоваяЕдиница КАК БазоваяЕдиницаИзмерения,
	             |	РасходнаяНакладная.Номенклатура.БазоваяЕдиница.Наименование КАК БазоваяЕдиницаИзмеренияНаименование,
	             |	РасходнаяНакладная.Номенклатура.БазоваяЕдиница.НаименованиеПолное КАК БазоваяЕдиницаИзмеренияНаименованиеПолное,
	             |	РасходнаяНакладная.Номенклатура.БазоваяЕдиница.Код КАК БазоваяЕдиницаИзмеренияКод,
	             |	РасходнаяНакладная.Единица.Ссылка КАК ЕдиницаХраненияОстатков,
	             |	0 КАК ЕдиницаХраненияОстатковВес,
	             |	0 КАК ЕдиницаХраненияОстатковОбъем,
	             |	РасходнаяНакладная.Единица.Наименование КАК ЕдиницаХраненияОстатковНаименование,
	             |	РасходнаяНакладная.Единица.Коэффициент КАК ЕдиницаХраненияОстатковКоэффициент,
	             |	РасходнаяНакладная.НомерСтроки КАК НомерСтроки,
	             |	РасходнаяНакладная.Номенклатура.Код КАК Ид,
	             |	"""" КАК Комментарий
	             |ИЗ
	             |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладная
	             |ГДЕ
	             |	РасходнаяНакладная.Ссылка В ИЕРАРХИИ(&СписокДок)
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ДокСсылка,
	             |	НомерСтроки
	             |ИТОГИ
	             |	СУММА(цена),
	             |	СУММА(сумма),
	             |	СУММА(СуммаНДС),
	             |	СУММА(Всего)
	             |ПО
	             |	ДокСсылка";
	
				 
		// |	РасходнаяНакладная.Ссылка.Курс КАК КурсВзаиморасчетов,
		 
	ИнициализацияИнформированиеПользователяОВыгрузкеДокументов("Выгрузка заказов покупателя", СписокДок, 1);	//ИнициализацияИнформированиеПользователяОВыгрузкеДокументов("Выгрузка заказов поставщику", СписокДок, ВыводитьИнформационныесообщения);
	Запрос.УстановитьПараметр("СписокДок", СписокДок);

	РезультатЗапрос = Запрос.Выполнить();
	Выборка         = РезультатЗапрос.Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("ДокСсылка") Цикл
		
		ОбъектXML.ЗаписатьНачалоЭлемента("Документ");
		
		ВыгрузитьЕдиныеРеквизитыДокументов(ОбъектXML, Выборка, "Отпуск товара", , ЛОЖЬ);
		
		ВыгрузитьИнформациюОНалогахДляВыборки(ОбъектXML, Выборка);
					
		ЗаписатьТекстовойУзел(ОбъектXML, "Комментарий",  Выборка.Комментарий);
		ИдКаталога = Выборка.ОрганизацияСсылка.УникальныйИдентификатор();
		
		ОбъектXML.ЗаписатьНачалоЭлемента("Товары");
		СохрНомерСтроки = 0;
		Пока Выборка.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(Выборка.НоменклатураСсылка) Тогда 
				Продолжить;
			КонецЕсли;

			//Не выгружаем дубли строки, которые возникают если один товар имеет более одного штрихкода
			Если СохрНомерСтроки = Выборка.НомерСтроки Тогда
				Продолжить;
			Иначе
				СохрНомерСтроки = Выборка.НомерСтроки;
			КонецЕсли;
			
			ОбъектXML.ЗаписатьНачалоЭлемента("Товар");
			Если НЕ ЗначениеЗаполнено(Выборка.Ид) Тогда
				ВыгрузитьОсновныеРеквизитыТовара(ОбъектXML, Выборка);
			Иначе
				ВыгрузитьОсновныеРеквизитыТовара(ОбъектXML, Выборка, "*"+Выборка.Ид);
			КонецЕсли;
			
			ВыгрузитьБазовыеРеквизитыТабличнойЧастиТоваров(ОбъектXML, Выборка, ИдКаталога);
			
			//Выгрузка информации по налогам
			ВыгрузитьИнформациюОНалогахДляВыборки(ОбъектXML, Выборка);
			
			//ВыгрузитьИнформациюОСерийномНомере(ОбъектXML, Выборка);
			
			ОбъектXML.ЗаписатьКонецЭлемента();
				
			
		КонецЦикла;
		
		ОбъектXML.ЗаписатьКонецЭлемента();
		
		//ЗначенияРеквизитов
		//ДобавитьИнформациюОДокументахОснования(ОбъектXML, Выборка);

		ОбъектXML.ЗаписатьКонецЭлемента();
		ОбновитьИнформированиеПользователяОВыгрузкеДокументов(ВыводитьИнформационныесообщения);
		
	КонецЦикла;
	
	ОкончаниеИнформированиеПользователяОВыгрузкеДокументов(ВыводитьИнформационныесообщения);
	
КонецПроцедуры



Процедура ИнициализацияИнформированиеПользователяОВыгрузкеДокументов(ТекстДляПользователя, СписокДок, ВыводитьИнформационныесообщения)
	
	//Если ВыводитьИнформационныесообщения Тогда
		ИнициализироватьФормуХодаОбработки(ТекстДляПользователя, 0, СписокДок.Количество());
	//КонецЕсли;	
	
КонецПроцедуры

Процедура ОбновитьИнформированиеПользователяОВыгрузкеДокументов(ВыводитьИнформационныесообщения)
	
	//Если ВыводитьИнформационныесообщения Тогда
		ОтобразитьНовоеСообщениеВФормеХодаОбработки("Выгрузка заказов покупателя", 1);
	//КонецЕсли;	
	
КонецПроцедуры

Процедура ОкончаниеИнформированиеПользователяОВыгрузкеДокументов(ВыводитьИнформационныесообщения)
	
	//Если ВыводитьИнформационныесообщения Тогда
		ЗакрытьФормуОбработкиДанных();
	//КонецЕсли;	
	
КонецПроцедуры

Процедура ВыгрузитьЕдиныеРеквизитыДокументов(ОбъектXML, Выборка, ИмяХозОперации, ВидДоговораПоУмолчанию, ВыгружатьСтруктурнуюЕдиницу = Ложь)
	
		
	РольКонтрагентаДляВыгрузки = "Покупатель";
	РольОрганизацииДляВыгрузки = "Продавец";
		
	ЗаписатьТекстовойУзел(ОбъектXML, "Ид", Строка(Выборка.ДокСсылка.УникальныйИдентификатор()));
	ЗаписатьТекстовойУзел(ОбъектXML, "Номер",       Выборка.Номер);
	ЗаписатьТекстовойУзел(ОбъектXML, "Дата",        Формат(Выборка.Дата, "ДФ=yyyy-MM-dd"));
	ЗаписатьТекстовойУзел(ОбъектXML, "ХозОперация", ИмяХозОперации);	
	ЗаписатьТекстовойУзел(ОбъектXML, "Роль",        РольОрганизацииДляВыгрузки);
	ЗаписатьВФайлВалюту(ОбъектXML, Выборка.Валюта);
	ЗаписатьТекстовойУзел(ОбъектXML, "Курс",        Выборка.КурсВзаиморасчетов);
	ЗаписатьТекстовойУзел(ОбъектXML, "Сумма",       Выборка.СуммаДокумента);
		
	ОбъектXML.ЗаписатьНачалоЭлемента("Контрагенты");
	
	СтруктурнаяЕдиница = ?(ВыгружатьСтруктурнуюЕдиницу, Выборка.СтруктурнаяЕдиница, Неопределено);
	ВыгрузитьКонтрагентаДок(ОбъектXML, Выборка.ОрганизацияСсылка, РольОрганизацииДляВыгрузки, СтруктурнаяЕдиница);
	ВыгрузитьКонтрагентаДок(ОбъектXML, Выборка.КонтрагентСсылка,  РольКонтрагентаДляВыгрузки);
	
	ОбъектXML.ЗаписатьКонецЭлемента();
	
	ЗаписатьТекстовойУзел(ОбъектXML, "Время", Формат(Выборка.Дата, "ДЛФ=T"));
    		
КонецПроцедуры

Процедура ЗаписатьВФайлВалюту(ОбъектXML, Валюта)
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаВалюты = "RUB"; // Сред(Строка(Валюта), 1, 3);
	
	ЗаписатьТекстовойУзел(ОбъектXML, "Валюта", СтрокаВалюты);
	
КонецПроцедуры

Процедура ДобавитьНовоеЗначениеРеквизита(ОбъектXML, Наименование, Значение, ПустоеЗначение = "", ИмяГруппыЭлементов = "ЗначениеРеквизита")
	
	ЗначениеДляЗаписи = Значение;
	Если ЗначениеДляЗаписи = Null Тогда
		ЗначениеДляЗаписи = ПустоеЗначение;
	КонецЕсли;
	
	// пустую строку не записываем
	Если ТипЗнч(ЗначениеДляЗаписи) = Тип("Строка") 
		И ПустаяСтрока(ЗначениеДляЗаписи) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ОбъектXML.ЗаписатьНачалоЭлемента(ИмяГруппыЭлементов);
	
	ЗаписатьТекстовойУзел(ОбъектXML, "Наименование",  Наименование, Ложь);
	ЗаписатьТекстовойУзел(ОбъектXML, "Значение",  ЗначениеДляЗаписи, Ложь);
	
	ОбъектXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры
 
// Процедура пищет в XML-файл информацию о контрагенте при выгрузке документов
//
// Параметры:
//  ОбъектXML  - объект типа ЗаписьXML
//  Контрагент - справочник-ссылка "КОнтрагенты"
//  Роль       - строка - значение тэга "Роль"
//
Процедура ВыгрузитьКонтрагентаДок(ОбъектXML, Контрагент, Роль = Неопределено, СтруктурнаяЕдиница = Неопределено, ИмяГруппыВыгрузки = "Контрагент")

	ОбъектXML.ЗаписатьНачалоЭлемента(ИмяГруппыВыгрузки);
	
	ЗаписатьТекстовойУзел(ОбъектXML, "Ид",           Строка(Контрагент.УникальныйИдентификатор()));
	ЗаписатьТекстовойУзел(ОбъектXML, "Наименование", Контрагент.Наименование);
	
	//Если Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
	//	ЗаписатьТекстовойУзел(ОбъектXML, "ОфициальноеНаименование", Контрагент.НаименованиеПолное);
	//	
	//	// выгрузка юридического адреса
	//	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Организации") Тогда
	//		ВыгрузитьЮрАдресОрганизации(ОбъектXML, Контрагент);
	//	КонецЕсли;
	//	
	//Иначе
	//	ЗаписатьТекстовойУзел(ОбъектXML, "ПолноеНаименование", Контрагент.НаименованиеПолное);
	//КонецЕсли;	
	
	ЗаписатьТекстовойУзел(ОбъектXML, "ИНН", Контрагент.ИНН);
	ЗаписатьТекстовойУзел(ОбъектXML, "КПП", Контрагент.КПП);
	Попытка
		// для организации
		ЗаписатьТекстовойУзел(ОбъектXML, "ОКПО", Контрагент.КодПоОКПО);
	исключение
	конецпопытки;
	
	Попытка
		// для контрагента
		ЗаписатьТекстовойУзел(ОбъектXML, "ОКПО", Контрагент.ОКПО);
	исключение
	конецпопытки;
	
	
	//ВыгрузитьБанковскийсчетОрганизации(ОбъектXML, СтруктурнаяЕдиница);
	
	Если Роль <> Неопределено Тогда
		ЗаписатьТекстовойУзел(ОбъектXML, "Роль", Роль);
	КонецЕсли;
	
	ОбъектXML.ЗаписатьКонецЭлемента();

КонецПроцедуры

// Процедура пищет в XML-файл обязательные для товара реквизиты
// если передан пустой идентификатор, то он формируется по умолчанию
//
// Параметры:
//  ОбъектXML - объект типа ЗаписьXML
//  Товар     - структура, содержащая реквизиты товара
//  Ид        - строка идентификатор товара
//
Процедура ВыгрузитьОсновныеРеквизитыТовара(ОбъектXML, Товар, Ид = Неопределено)

	Если НЕ ЗначениеЗаполнено(Ид) Тогда
		ИдТовара = СформироватьИдентификатовТовара(Товар.НоменклатураСсылка, Товар.ХарактеристикаСсылка);
		ЗаписатьТекстовойУзел(ОбъектXML, "Ид", ИдТовара);
	Иначе
		ЗаписатьТекстовойУзел(ОбъектXML, "Ид", Ид);		
	КонецЕсли;
	
	//++-++
	// выводить штрих код товара
	
	ШтрихКод="";
	//-------------------
	Попытка
		
		ТипШк = Перечисления.ТипыШтрихКодов.Штука;
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	ШтрихКоды.Владелец КАК Номенклатура,
		|	ШтрихКоды.Наименование как номер,
		|	ШтрихКоды.Код
		|ИЗ
		|	Справочник.ШтрихКоды КАК ШтрихКоды
		|ГДЕ
		|	ШтрихКоды.ТипШК = &ТипШК
		|	И ШтрихКоды.Владелец = &ТекНом";
		
		Запрос.УстановитьПараметр("ТекНом",Товар.НоменклатураСсылка); 
		Запрос.УстановитьПараметр("ТипШК",ТипШк);
		
		Выборка1 = запрос.Выполнить().Выбрать();
		
		Пока выборка1.Следующий() Цикл
			ШтрихКод=выборка1.Номер; //ШКО+"@"
		КонецЦикла;	
		
	Исключение
	КонецПопытки;

	
	ЗаписатьТекстовойУзел(ОбъектXML, "Штрихкод",    ШтрихКод);
	//ЗаписатьТекстовойУзел(ОбъектXML, "Артикул",      Товар.Артикул);

	ВыгрузитьНаименованиеНоменклатуры(ОбъектXML, Товар);
	
	ВыгрузитьИнформациюОЕдиницеИзмерения(ОбъектXML, Товар);
		
	//ВыгрузитьИдентификаторГруппыДляТовара(ОбъектXML, Товар);
	
	// выгрузить информацию по ставке налога
	ВыгрузитьИнформациюОСтавкеНалога(ОбъектXML, Товар);
	
	ВыгрузитьДопИнформациюОНоменклатуре(ОбъектXML, Товар);	
	
КонецПроцедуры


Процедура ВыгрузитьДопИнформациюОНоменклатуре(ОбъектXML, Товар)
	
	//ЕстьЗначенияСвойств = ЗначениеЗаполнено(Товар.ВидНоменклатуры)
	//					ИЛИ ЗначениеЗаполнено(Товар.ТипНоменклатуры);
	//					
	//Если Не ЕстьЗначенияСвойств Тогда
	//	Возврат;
	//КонецЕсли;
	
	ОбъектXML.ЗаписатьНачалоЭлемента("ЗначенияРеквизитов");
	
	ДобавитьНовоеЗначениеРеквизита(ОбъектXML, "ВидНоменклатуры", "Товар");
	ДобавитьНовоеЗначениеРеквизита(ОбъектXML, "ТипНоменклатуры", "Товар");
	//ДобавитьНовоеЗначениеРеквизита(ОбъектXML, "НаименованиеКраткое", Товар.Наименование);
	//ДобавитьНовоеЗначениеРеквизита(ОбъектXML, "НаименованиеПолное", Товар.НаименованиеПолное);
		
	ОбъектXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры



Функция ВыгрузитьНаименованиеНоменклатуры(ОбъектXML, Товар)
	
	НаименованиеНоменклатуры = ?(ЗначениеЗаполнено(Товар.НаименованиеПолное), Товар.НаименованиеПолное, Товар.Наименование);
	
	ИмяТовара = НаименованиеНоменклатуры;
	
	//
	//Если НЕ ЗначениеЗаполнено(Товар.ХарактеристикаСсылка) Тогда
	//	ИмяТовара = НаименованиеНоменклатуры;
	//Иначе
	//	ИмяТовара = СокрЛП(НаименованиеНоменклатуры) + " (" + СокрЛП(Товар.НаименованиеХарактеристики) + ")";
	//КонецЕсли;
	
	ЗаписатьТекстовойУзел(ОбъектXML, "Наименование", ИмяТовара);
	
КонецФункции

Процедура ВыгрузитьРазмерСтавкиНДС(ОбъектXML, Товар)
	
	//++-++
	// получить ставку НДС для товара
	
	
	ЗаписатьТекстовойУзел(ОбъектXML, "Ставка", Товар.СтавкаНДС);
	
КонецПроцедуры

Процедура ВыгрузитьИнформациюОСтавкеНалога(ОбъектXML, Товар)
	
	Если Не ЗначениеЗаполнено(Товар.СтавкаНДС) Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектXML.ЗаписатьНачалоЭлемента("СтавкиНалогов");
	
	ОбъектXML.ЗаписатьНачалоЭлемента("СтавкаНалога");
    	
	ЗаписатьТекстовойУзел(ОбъектXML, "Наименование", "НДС");
	
	ВыгрузитьРазмерСтавкиНДС(ОбъектXML, Товар);
    	
	ОбъектXML.ЗаписатьКонецЭлемента();
	
	ОбъектXML.ЗаписатьКонецЭлемента();
	
КонецПроцедуры

Процедура ВыгрузитьИнформациюОЕдиницеИзмерения(ОбъектXML, Товар)
	
	//Товар.БазоваяЕдиницаИзмерения
	//Товар.БазоваяЕдиницаИзмеренияНаименование
	//Товар.БазоваяЕдиницаИзмеренияКод
	//Товар.БазоваяЕдиницаИзмеренияНаименованиеПолное
	//Товар.БазоваяЕдиницаИзмеренияМеждународноеСокращение
	//Товар.ЕдиницаХраненияОстатков
	//Товар.ЕдиницаХраненияОстатковКоэффициент
	//Товар.ЕдиницаХраненияОстатковНаименование
	//Товар.ЕдиницаХраненияОстатковВес
	//Товар.ЕдиницаХраненияОстатковОбъем	
	
	//++-++ 
	//базовую единицу измерения расчитать.
	
	Если ЗначениеЗаполнено(Товар.БазоваяЕдиницаИзмерения) Тогда
		
		ОбъектXML.ЗаписатьНачалоЭлемента("БазоваяЕдиница");
		
		Если Не ПустаяСтрока(Товар.БазоваяЕдиницаИзмеренияКод) Тогда
			ОбъектXML.ЗаписатьАтрибут("Код", Товар.БазоваяЕдиницаИзмеренияКод);
		КонецЕсли;
		
		Если Не ПустаяСтрока(Товар.БазоваяЕдиницаИзмеренияНаименованиеПолное) Тогда
			ОбъектXML.ЗаписатьАтрибут("НаименованиеПолное", Товар.БазоваяЕдиницаИзмеренияНаименованиеПолное);
		КонецЕсли;
		
		Если Не ПустаяСтрока(Товар.БазоваяЕдиницаИзмеренияМеждународноеСокращение) Тогда
			ОбъектXML.ЗаписатьАтрибут("МеждународноеСокращение", Товар.БазоваяЕдиницаИзмеренияМеждународноеСокращение);
		КонецЕсли;
		
		// нужно передать информация о единице измерения для номенклатуры
		//Если ЗначениеЗаполнено(Товар.ЕдиницаХраненияОстатков) Тогда
		//	
		//	ОбъектXML.ЗаписатьНачалоЭлемента("Пересчет");	
		//	
		//	ЗаписатьТекстовойУзел(ОбъектXML, "Единица",     Товар.ЕдиницаХраненияОстатковНаименование);
		//	ЗаписатьТекстовойУзел(ОбъектXML, "Коэффициент", Товар.ЕдиницаХраненияОстатковКоэффициент);
		//	
		//	ОбъектXML.ЗаписатьНачалоЭлемента("ДополнительныеДанные");
		//	
		//	ДобавитьНовоеЗначениеРеквизита(ОбъектXML, "Вес",  Товар.ЕдиницаХраненияОстатковВес);
		//	ДобавитьНовоеЗначениеРеквизита(ОбъектXML, "Объем",  Товар.ЕдиницаХраненияОстатковОбъем);
		//	
		//	ОбъектXML.ЗаписатьКонецЭлемента();
		//	
		//	ОбъектXML.ЗаписатьКонецЭлемента();
		//	
		//КонецЕсли;		
		
		ОбъектXML.ЗаписатьТекст(Товар.БазоваяЕдиницаИзмеренияНаименование);
		
		ОбъектXML.ЗаписатьКонецЭлемента();		
				
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьИнформациюОНалогахДляВыборки(ОбъектXML, Выборка)
	
	//Выгрузка информации по налогам в докменте
	Если Выборка.СуммаНДС Тогда
		ОбъектXML.ЗаписатьНачалоЭлемента("Налоги");
		ВыгрузитьНДС(ОбъектXML, "True", Выборка.СуммаНДС);  // сума включает НДС
		ОбъектXML.ЗаписатьКонецЭлемента();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыгрузитьБазовыеРеквизитыТабличнойЧастиТоваров(ОбъектXML, Выборка, ИдКаталога)
	
	ЗаписатьТекстовойУзел(ОбъектXML, "ИдКаталога",       ИдКаталога);
	ЗаписатьТекстовойУзел(ОбъектXML, "ЦенаЗаЕдиницу",    Выборка.Цена);
	ЗаписатьТекстовойУзел(ОбъектXML, "Количество",       Выборка.Количество);
	ЗаписатьТекстовойУзел(ОбъектXML, "Сумма",            Выборка.Сумма);
	ЗаписатьТекстовойУзел(ОбъектXML, "Единица",          Выборка.ЕдиницаХраненияОстатков);
	ЗаписатьТекстовойУзел(ОбъектXML, "Коэффициент",      "1");	
	
КонецПроцедуры
  
// Процедура пищет в XML-файл информацию о налоге НДС
//
// Параметры:
//  ОбъектXML    - объект типа ЗаписьXML
//  УчтеноВСумме - флаг НДС в сумме
//  Сумма        -  сумма НДС
//
Процедура ВыгрузитьНДС(ОбъектXML, УчтеноВСумме, Сумма = 0)

	ОбъектXML.ЗаписатьНачалоЭлемента("Налог");
	ЗаписатьТекстовойУзел(ОбъектXML, "Наименование", "НДС");
	ЗаписатьТекстовойУзел(ОбъектXML, "УчтеноВСумме", УчтеноВСумме);
	Если Сумма Тогда
		ЗаписатьТекстовойУзел(ОбъектXML, "Сумма", Сумма);
	КонецЕсли;
	ОбъектXML.ЗаписатьКонецЭлемента();

КонецПроцедуры


// Процедура контролирует и выгружает документ "Заказ поставщику"
// Вызывается из формы документа
//
// Параметры:
//  Документ - документ-ссылка "Заказ поставщику"
//
Процедура ВыгрузитьИзДокумента(Документ) Экспорт

	ИмяТипаДокумента = ОпределитьИмяТипаДокумента(Документ);
	
	Если Метаданные.Документы[ИмяТипаДокумента].Проведение = Метаданные.свойстваОбъектов.Проведение.Разрешить
		И НЕ Документ.Проведен Тогда
		
		Предупреждение("Непроведенный документ не может быть выгружен!");
		Возврат;
		
	КонецЕсли;
	
	ИмяФайлаПоУмолчанию = ОпределитьИмяФайлаДляСохраненияПоУмолчанию(Строка(Документ.Контрагент), ИмяТипаДокумента);
	
	ИмяФайла = ВыборФайла2(РежимДиалогаВыбораФайла.Сохранение, ИмяФайлаПоУмолчанию);
	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьДокументВФайл(Документ, ИмяФайла);
	
	Предупреждение("Выгрузка завершена!");

КонецПроцедуры

Процедура СохранитьДокументВФайл(Документ, ИмяФайла)
	
	ИмяТипаДокумента = ОпределитьИмяТипаДокумента(Документ);

	СписокДок = Новый СписокЗначений();
	СписокДок.Добавить(Документ);

	ОбъектXML = Новый ЗаписьXML;
	ОбъектXML.ОткрытьФайл(ИмяФайла);
	ОбъектXML.ЗаписатьОбъявлениеXML();
	ОбъектXML.ЗаписатьНачалоЭлемента("КоммерческаяИнформация");
	ВыгрузитьДокументы(ОбъектXML, СписокДок, ИмяТипаДокумента, Ложь);
	ОбъектXML.ЗаписатьКонецЭлемента();
	ОбъектXML.Закрыть();	
	
КонецПроцедуры

#КонецЕсли

Функция ОпределитьИмяТипаДокумента(Документ) Экспорт
	
	МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(Документ));
	
	Возврат МетаданныеОбъекта.Имя;
	
КонецФункции


ВыводитьИнформационныесообщения=1;
                                                                                    
мФормаХодаВыполненияОбмена = Неопределено;
мТаблицаВсехСвойствТоваров = Неопределено;

#Если Клиент Тогда

ИмяПрайса = "Прайс-лист от "+ Строка(Формат(РабочаяДата, "ДФ=dd.MM.yyyy"));
ИмяКаталога = "Каталог товаров от "+ Строка(Формат(РабочаяДата, "ДФ=dd.MM.yyyy"));

#КонецЕсли
